# Не найден корректный код активации

Для корректной работы тестов следует обновить программу и/или ключи.

Шаги по устранению проблемы:
- Проверьте, что в профиле указаны корректные ключи
- Проверьте, что даты в профиле указаны корректно
- Проверьте подключение приложения к сети Интернет
- Перезапустите приложение
- Если предыдущие шаги не помогли, то **обновите приложение**:
  - **Для Docker версии (рекомендуется)**  через [Docker Hub](https://hub.docker.com/r/khmelov/distcomp)
  - **Для Desktop версии** скачайте обновление [отсюда](https://bit.ly/poit-dist-comp)

При сложностях обратитесь к разработчику для получения дополнительной информации
[по email](mailto:a.khmelev+dc@gmail.com?subject=Distributed%20Computing%20Update)